* Notes
* Mutt FAQ  https://www.fefe.de/muttfaq/faq.html                      :NOTE:
 [2021-06-26 Sat 03:51]
* Linux Kernel WIKI  https://wiki.kernel.org/                         :NOTE:
 [2021-06-26 Sat]
* Vim Tips  https://vim.fandom.com/wiki/Best_Vim_Tips                 :NOTE:
 [2021-06-26 Sat 16:54]
 :NOTE: [[https://vim.fandom.com/wiki/Best_Vim_Tips][Best vim tips site]]
* :NOTE: This are details of passport for the family                  :ATTACH:
  :PROPERTIES:
  :ID:       75395de8-7503-4034-8c5b-283d650bc50b
  :END:
  :LOGBOOK:
  CLOCK: [2021-06-05 Sat 11:18]--[2021-06-05 Sat 11:21] =>  0:03
  :END:
[2021-06-05 Sat 11:18]
[[file:~/.emacs.d/OrgFiles/task.org::*Reminds about passport renewals][Reminds about passport renewals]]
* The hand phone has to be replaced, it is almost defunct ..heck       :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-23 Wed 04:45]--[2021-06-23 Wed 04:46] =>  0:01
  :END:
[2021-06-23 Wed 04:45]
[[file:~/.emacs.d/OrgFiles/task.org][file:~/.emacs.d/OrgFiles/task.org]]
* The laptop is showing it's age, highly needed a upgrade...meh        :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-23 Wed 04:47]--[2021-06-23 Wed 04:48] =>  0:01
  :END:
[2021-06-23 Wed 04:47]
[[file:~/.emacs.d/OrgFiles/task.org][file:~/.emacs.d/OrgFiles/task.org]]
* AquaGuard gets old ...needs replacement...cost around 25k..wondering.. :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 09:00]--[2021-06-24 Thu 09:01] =>  0:01
  :END:
[2021-06-24 Thu 09:00]
[[file:~/.emacs.d/OrgFiles/task.org::+TITLE: Keep track of things which needs attention]]
* GCC: [[https://gcc.gnu.org/][The GNU Compiler Collection]]                                      :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:16]--[2021-06-24 Thu 14:17] =>  0:01
  :END:
[2021-06-24 Thu 14:16]
[[deft:contacts.org][contacts]]
* Clang: [[https://clang.llvm.org/][A C language family frontend for LLVM]]                          :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:18]--[2021-06-24 Thu 14:19] =>  0:01
  :END:
[2021-06-24 Thu 14:18]
[[deft:notes.org][notes]]
* LLVM: [[https://www.llvm.org/][The LLVM Compiler Infrastructure]]                                :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:19]--[2021-06-24 Thu 14:20] =>  0:01
  :END:
[2021-06-24 Thu 14:19]
[[deft:notes.org][notes]]
* LFS: [[https://www.linuxfromscratch.org/][Linux From Scratch!]]                                              :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:21]--[2021-06-24 Thu 14:22] =>  0:01
  :END:
[2021-06-24 Thu 14:21]
[[deft:notes.org][notes]]
* Lex and Yacc : [[https://developer.ibm.com/technologies/systems/tutorials/au-lexyacc/][Lex and Yacc on IBM Developer site]]                     :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:23]--[2021-06-24 Thu 14:23] =>  0:00
  :END:
[2021-06-24 Thu 14:23]
[[deft:notes.org][notes]]
* Lex and Yacc : [[http://dinosaur.compilertools.net/][Lex and Yacc page,all the info]]                         :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:24]--[2021-06-24 Thu 14:24] =>  0:00
  :END:
[2021-06-24 Thu 14:24]
[[deft:notes.org][notes]]
* Bash Wiki: [[http://mywiki.wooledge.org/BashFAQ/006][Bash FAQ]]                                                   :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:39]--[2021-06-24 Thu 14:40] =>  0:01
  :END:
[2021-06-24 Thu 14:39]
* Bash-Awesome: [[https://github.com/awesome-lists/awesome-bash][A curated bash goodies]]                                  :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:41]--[2021-06-24 Thu 14:41] =>  0:00
  :END:
[2021-06-24 Thu 14:41]
* Emacs key binds to find information C-h-k for keybinds,C-h-v for varibables,C-h-f for function :NOTE:
  :LOGBOOK:
  CLOCK: [2021-07-03 Sat 17:27]--[2021-07-03 Sat 17:29] =>  0:02
  :END:
[2021-07-03 Sat 17:27]
* Monthly internet and phone bill pay,approx 1.5k                      :NOTE:
  :LOGBOOK:
  CLOCK: [2021-07-04 Sun 04:48]--[2021-07-04 Sun 04:49] =>  0:01
  :END:
[2021-07-04 Sun 04:48]
